namespace test
{
namespace lorem
{

auto latin = "Lorem ipsum dolor sit amet, consectetur adipiscing elit. Aliquam aliquet sit amet "
             "lacus tincidunt pharetra. Quisque egestas, lorem suscipit ultrices molestie, quam "
             "diam pretium ante, eget blandit enim ipsum ut nisi. Donec a porta sapien. "
             "Suspendisse vel malesuada lacus. Nulla tempus blandit massa in commodo. Aenean magna "
             "turpis, sodales id iaculis pharetra, lobortis nec diam. Nunc pellentesque eu enim in "
             "fringilla. Phasellus nec turpis id erat fermentum scelerisque. Aliquam nec nisl id "
             "dolor ullamcorper dignissim quis nec ligula. ";
auto arabian = "حيث عن العسكري تشيكوسلوفاكيا. تحت وقرى مشروط الأوروبية مع. إذ تحت أملاً "
               "المبرمة. أن فصل المعاهدات واندونيسيا، تشيكوسلوفاكيا.";
auto korean = "국민경제의 발전을 위한 중요정책의 수립에 관하여 대통령의 자문에 응하기 "
              "위하여 국민경제자문회의를 둘 수 있다.";
auto greek = "Λορεμ ιπσθμ δολορ σιτ αμετ, μει ιδ νοvθμ φαβελλασ πετεντιθμ vελ νε, ατ νισλ "
             "σονετ οπορτερε εθμ. Αλιι δοcτθσ μει ιδ, νο αθτεμ αθδιρε ιντερεσσετ μελ, "
             "δοcενδι cομμθνε οπορτεατ τε cθμ.";
auto japanese = "旅ロ京青利セムレ弱改フヨス波府かばぼ意送でぼ調掲察たス日西重ケアナ住橋ユ"
                "ムミク順待ふかんぼ人奨貯鏡すびそ。";
auto russian = "Лорем ипсум долор сит амет, пер цлита поссит ех, ат мунере фабулас "
               "петентиум сит. Иус цу цибо саперет сцрипсерит, нец виси муциус лабитур "
               "ид. Ет хис нонумес нолуиссе дигниссим.";
auto chinese = "側経意責家方家閉討店暖育田庁載社転線宇。得君新術治温抗添代話考振投員殴大闘"
               "北裁。品間識部案代学凰処済準世一戸刻法分。悼測済諏計飯利安凶断理資沢同岩面"
               "文認革。内警格化再薬方久化体教御決数詭芸得筆代。";
auto indian = "पढाए हिंदी रहारुप अनुवाद कार्यलय मुख्य संस्था सोफ़तवेर निरपेक्ष उनका आपके बाटते आशाआपस "
              "मुख्यतह उशकी करता। शुरुआत संस्था कुशलता मेंभटृ अनुवाद गएआप विशेष सकते परिभाषित लाभान्वित "
              "प्रति देकर समजते दिशामे प्राप्त जैसे वर्णन संस्थान निर्माता प्रव्रुति भाति चुनने उपलब्ध बेंगलूर "
              "अर्थपुर्ण";
auto armenian = "լոռեմ իպսում դոլոռ սիթ ամեթ, լաբոռե մոդեռաթիուս եթ հաս, պեռ ոմնիս լաթինե "
                "դիսպութաթիոնի աթ, վիս ֆեուգաիթ ծիվիբուս եխ. վիվենդում լաբոռամուս "
                "ելաբոռառեթ նամ ին. ";
auto hebrew = "כדי יסוד מונחים מועמדים של, דת דפים מאמרשיחהצפה זאת. אתה דת שונה כלשהו, גם "
              "אחר ליום בשפות, או ניווט פולנית לחיבור ארץ. ויש בקלות ואמנות אירועים או, "
              "אל אינו כלכלה שתי. ";
auto thai = "ไบเบิลปักขคณนาตี๋น้องใหม่ฟลอร์ เก๋ากี้ ดีพาร์ทเมนต์เมี่ยงคำอุปนายกยอมรับดอกเตอร์ แฟกซ์แบ็กโฮทีวี "
            "ซัมเมอร์ เซลส์ไฮไลต์ซิลเวอร์ผิดพลาดแกงค์ ซื่อบื้อพาเหรดคอนโทรลเป่ายิงฉุบ เกรด ตอกย้ำ "
            "บรานาฏยศาลาเซอร์วิสบาลานซ์ ฮองเฮาปิกอัพเหี่ยวย่น ทัวร์สปอร์ต ขั้นตอนโกเต็กซ์สถาปัตย์ ";
} // namespace lorem

namespace adhoc
{
auto mixed_cstr = "huu 🌮(त रू 𝔠 ௹➾ أجو)بة x👩‍👩‍👧‍👦{é}";
auto emojis     = "👩‍👩‍👧‍👦🌮👩🇫🇮💞🌻";
auto all_part1 = "@L字Яかカทب가अΩאகಕდകకԱကકকਕລ̈កཀඅአތକ﷐ᓀܐㄅߘᏄꊈࠀϢᠦⰀꕉᬅⵞꚠᯀꨀꦄꤊᰀᤀꓨࡀ"
                 "ꯀ"
                 "ᦀ"
                 "ᱚ"
                 "ꢂ"
                 "ᮃ"
                 "ꠀ"
                 "ᥐ"
                 "ᨠ"
                 "ꪀ"
                 "𐬀"
                 "𑀅"
                 "ᨀ";
auto all_part2 = "ᝃ𐊷𒀀𐠀𐐔𓅓𐌰ᜣ𐡀𐭠𐭀𑂃𐨀𐀀𐊀𐤠ᚏ𐌈𐎠𐩠𐰀𐒀ꡀ𐤀ꤰᚠ𐑐ᜃᝣ𐎀𑄃𐦠𐦀𖼀𑆃𑃐𑚀⠎𐔷𖫦𛰠𐔀𑌕𖬜𑈈𐙇𑅒𐫁𞠂𑘎𖩏𐪕𐢖𐡳𑫀𐍫𐮏𑖎𑊾𑒄𑢴𑜗𔐀𐣴𑊏𐲡𝡐";
auto all_part3
    = "𞤉𑰎𑱲𐒵"
      "𘈩𑐒𑴐𛇄𑩜𑨋𑠋𑵱𐴒𑻥𖹀𐼙𐽂𐿱𞄈𑧎𞋡𐾿𑤌𘱥𐺈𒿥𐽼𖪼𞊐𐖂𑼛𞓦"
      "𐵝"
      "𖄜"
      "𖵅"
      "𞗐"
      "𑯄"
      "𐗂"
      "𑎒"
      "𖶓"
      "𐥐"
      "𞛕"
      "𑷆";
auto latin_variants = "其妙يا جبل ما يهزك העולם "
                      "ăѣ𝔠ծềſģȟᎥ𝒋ǩľḿꞑȯ𝘱𝑞𝗋𝘴ȶ𝞄𝜈ψ𝒙𝘆𝚣1234567890!@#$%^&*()-_=+[{]};:',<.>/"
                      "?~𝘈Ḇ𝖢𝕯٤ḞԍНǏ𝙅ƘԸⲘ𝙉০Ρ𝗤Ɍ𝓢ȚЦ𝒱Ѡ𝓧ƳȤѧᖯć𝗱ễ𝑓𝙜Ⴙ𝞲𝑗𝒌ļṃŉо𝞎𝒒ᵲꜱ𝙩ừ𝗏ŵ𝒙𝒚ź1234567890!@#$%^&"
                      "*()-_=+[{]};:',<.>/"
                      "?~АḂⲤ𝗗𝖤𝗙ꞠꓧȊ𝐉𝜥ꓡ𝑀𝑵Ǭ𝙿𝑄Ŗ𝑆𝒯𝖴𝘝𝘞ꓫŸ𝜡ả𝘢ƀ𝖼ḋếᵮℊ𝙝Ꭵ𝕛кιṃդⱺ𝓅𝘲𝕣𝖘ŧ𝑢ṽẉ𝘅ყž1234567890!@#$%^"
                      "&*()-_=+[{]};:',<.>/"
                      "?~Ѧ𝙱ƇᗞΣℱԍҤ١𝔍К𝓛𝓜ƝȎ𝚸𝑄Ṛ𝓢ṮṺƲᏔꓫ𝚈𝚭𝜶Ꮟçძ𝑒𝖿𝗀ḧ𝗂𝐣ҝɭḿ𝕟𝐨𝝔𝕢ṛ𝓼тú𝔳ẃ⤬𝝲𝗓1234567890!@#$%^&"
                      "*()-_=+[{]};:',<.>/?~𝖠Β𝒞𝘋𝙴𝓕ĢȞỈ𝕵ꓗʟ𝙼ℕ০𝚸𝗤ՀꓢṰǓⅤ𝔚Ⲭ𝑌𝙕𝘢𝕤";

auto latin_cstr          = "älkäös Rénè! ȟ";
auto arabic_cstr         = "أسئلة و أجوبة";
auto arabic_no_spcs_cstr = "أسئلةوأجوبة";
auto han_cstr            = "緳 踥踕";
auto devanagari_cstr     = "हालाँकि प्रचलित रूप पूजा";
auto sth_cstr = "Z͑ͫ̓ͪ̂ͫ̽͏̴̙̤̞͉͚̯̞̠͍A̴̵̜̰͔ͫ͗͢L̠ͨͧͩ͘G̴̻͈͍͔̹̑͗̎̅͛́Ǫ̵̹̻̝̳͂̌̌͘!͖̬̰̙̗̿̋ͥͥ̂ͣ̐́́͜͞";
auto emoji_cstr       = "🌮👩‍👩‍👧‍👦";
auto apple_chars_cstr = "௹☞➾";
auto maths_cstr       = "⩤⪉⦫∷𝞿∰⩪⩭𝔠";

auto zalgo = "Z͑ͫ̓ͪ̂ͫ̽͏̴̙̤̞͉͚̯̞̠͍A̴̵̜̰͔ͫ͗͢L̠ͨͧͩ͘G̴̻͈͍͔̹̑͗̎̅͛́Ǫ̵̹̻̝̳͂̌̌͘!͖̬̰̙̗̿̋ͥͥ̂ͣ̐́́͜͞";
} // namespace adhoc
} // namespace test